/* automatically generated by rust-bindgen 0.72.1 */

unsafe extern "C" {
    pub static mut _libiconv_version: ::std::os::raw::c_int;
}
pub type libiconv_t = *mut ::std::os::raw::c_void;
pub type wchar_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
unsafe extern "C" {
    pub fn libiconv_open(
        tocode: *const ::std::os::raw::c_char,
        fromcode: *const ::std::os::raw::c_char,
    ) -> libiconv_t;
}
unsafe extern "C" {
    pub fn libiconv(
        cd: libiconv_t,
        inbuf: *mut *const ::std::os::raw::c_char,
        inbytesleft: *mut usize,
        outbuf: *mut *mut ::std::os::raw::c_char,
        outbytesleft: *mut usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn libiconv_close(cd: libiconv_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iconv_allocation_t {
    pub dummy1: [*mut ::std::os::raw::c_void; 28usize],
    pub dummy2: mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iconv_allocation_t"][::std::mem::size_of::<iconv_allocation_t>() - 232usize];
    ["Alignment of iconv_allocation_t"][::std::mem::align_of::<iconv_allocation_t>() - 8usize];
    ["Offset of field: iconv_allocation_t::dummy1"]
        [::std::mem::offset_of!(iconv_allocation_t, dummy1) - 0usize];
    ["Offset of field: iconv_allocation_t::dummy2"]
        [::std::mem::offset_of!(iconv_allocation_t, dummy2) - 224usize];
};
unsafe extern "C" {
    pub fn libiconv_open_into(
        tocode: *const ::std::os::raw::c_char,
        fromcode: *const ::std::os::raw::c_char,
        resultp: *mut iconv_allocation_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn libiconvctl(
        cd: libiconv_t,
        request: ::std::os::raw::c_int,
        argument: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
pub type iconv_unicode_char_hook = ::std::option::Option<
    unsafe extern "C" fn(uc: ::std::os::raw::c_uint, data: *mut ::std::os::raw::c_void),
>;
pub type iconv_wide_char_hook =
    ::std::option::Option<unsafe extern "C" fn(wc: wchar_t, data: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iconv_hooks {
    pub uc_hook: iconv_unicode_char_hook,
    pub wc_hook: iconv_wide_char_hook,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iconv_hooks"][::std::mem::size_of::<iconv_hooks>() - 24usize];
    ["Alignment of iconv_hooks"][::std::mem::align_of::<iconv_hooks>() - 8usize];
    ["Offset of field: iconv_hooks::uc_hook"]
        [::std::mem::offset_of!(iconv_hooks, uc_hook) - 0usize];
    ["Offset of field: iconv_hooks::wc_hook"]
        [::std::mem::offset_of!(iconv_hooks, wc_hook) - 8usize];
    ["Offset of field: iconv_hooks::data"][::std::mem::offset_of!(iconv_hooks, data) - 16usize];
};
pub type iconv_unicode_mb_to_uc_fallback = ::std::option::Option<
    unsafe extern "C" fn(
        inbuf: *const ::std::os::raw::c_char,
        inbufsize: usize,
        write_replacement: ::std::option::Option<
            unsafe extern "C" fn(
                buf: *const ::std::os::raw::c_uint,
                buflen: usize,
                callback_arg: *mut ::std::os::raw::c_void,
            ),
        >,
        callback_arg: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ),
>;
pub type iconv_unicode_uc_to_mb_fallback = ::std::option::Option<
    unsafe extern "C" fn(
        code: ::std::os::raw::c_uint,
        write_replacement: ::std::option::Option<
            unsafe extern "C" fn(
                buf: *const ::std::os::raw::c_char,
                buflen: usize,
                callback_arg: *mut ::std::os::raw::c_void,
            ),
        >,
        callback_arg: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ),
>;
pub type iconv_wchar_mb_to_wc_fallback = ::std::option::Option<
    unsafe extern "C" fn(
        inbuf: *const ::std::os::raw::c_char,
        inbufsize: usize,
        write_replacement: ::std::option::Option<
            unsafe extern "C" fn(
                buf: *const wchar_t,
                buflen: usize,
                callback_arg: *mut ::std::os::raw::c_void,
            ),
        >,
        callback_arg: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ),
>;
pub type iconv_wchar_wc_to_mb_fallback = ::std::option::Option<
    unsafe extern "C" fn(
        code: wchar_t,
        write_replacement: ::std::option::Option<
            unsafe extern "C" fn(
                buf: *const ::std::os::raw::c_char,
                buflen: usize,
                callback_arg: *mut ::std::os::raw::c_void,
            ),
        >,
        callback_arg: *mut ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iconv_fallbacks {
    pub mb_to_uc_fallback: iconv_unicode_mb_to_uc_fallback,
    pub uc_to_mb_fallback: iconv_unicode_uc_to_mb_fallback,
    pub mb_to_wc_fallback: iconv_wchar_mb_to_wc_fallback,
    pub wc_to_mb_fallback: iconv_wchar_wc_to_mb_fallback,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iconv_fallbacks"][::std::mem::size_of::<iconv_fallbacks>() - 40usize];
    ["Alignment of iconv_fallbacks"][::std::mem::align_of::<iconv_fallbacks>() - 8usize];
    ["Offset of field: iconv_fallbacks::mb_to_uc_fallback"]
        [::std::mem::offset_of!(iconv_fallbacks, mb_to_uc_fallback) - 0usize];
    ["Offset of field: iconv_fallbacks::uc_to_mb_fallback"]
        [::std::mem::offset_of!(iconv_fallbacks, uc_to_mb_fallback) - 8usize];
    ["Offset of field: iconv_fallbacks::mb_to_wc_fallback"]
        [::std::mem::offset_of!(iconv_fallbacks, mb_to_wc_fallback) - 16usize];
    ["Offset of field: iconv_fallbacks::wc_to_mb_fallback"]
        [::std::mem::offset_of!(iconv_fallbacks, wc_to_mb_fallback) - 24usize];
    ["Offset of field: iconv_fallbacks::data"]
        [::std::mem::offset_of!(iconv_fallbacks, data) - 32usize];
};
unsafe extern "C" {
    pub fn libiconvlist(
        do_one: ::std::option::Option<
            unsafe extern "C" fn(
                namescount: ::std::os::raw::c_uint,
                names: *const *const ::std::os::raw::c_char,
                data: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        data: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn iconv_canonicalize(name: *const ::std::os::raw::c_char)
    -> *const ::std::os::raw::c_char;
}
